wosayttn/Gerrit_NuMicro/M2003xI_M2003xJ_Series/Library/Device/Nuvoton/M2003J/Include/uspi_reg.h
#define USPI_PROTSTS_TXENDIF_Pos         (2)                                               /*!< USPI_T::PROTSTS: TXENDIF Position      */
#define USPI_PROTSTS_TXENDIF_Msk         (0x1ul << USPI_PROTSTS_TXENDIF_Pos)               /*!< USPI_T::PROTSTS: TXENDIF Mask          */

#define USPI_PROTSTS_RXSTIF_Pos          (3)                                               /*!< USPI_T::PROTSTS: RXSTIF Position       */
#define USPI_PROTSTS_RXSTIF_Msk          (0x1ul << USPI_PROTSTS_RXSTIF_Pos)                /*!< USPI_T::PROTSTS: RXSTIF Mask           */

#define USPI_PROTSTS_RXENDIF_Pos         (4)                                               /*!< USPI_T::PROTSTS: RXENDIF Position      */
#define USPI_PROTSTS_RXENDIF_Msk         (0x1ul << USPI_PROTSTS_RXENDIF_Pos)               /*!< USPI_T::PROTSTS: RXENDIF Mask          */

#define USPI_PROTSTS_SLVTOIF_Pos         (5)                                               /*!< USPI_T::PROTSTS: SLVTOIF Position      */
#define USPI_PROTSTS_SLVTOIF_Msk         (0x1ul << USPI_PROTSTS_SLVTOIF_Pos)               /*!< USPI_T::PROTSTS: SLVTOIF Mask          */

#define USPI_PROTSTS_SLVBEIF_Pos         (6)                                               /*!< USPI_T::PROTSTS: SLVBEIF Position      */
#define USPI_PROTSTS_SLVBEIF_Msk         (0x1ul << USPI_PROTSTS_SLVBEIF_Pos)               /*!< USPI_T::PROTSTS: SLVBEIF Mask          */

#define USPI_PROTSTS_SSINAIF_Pos         (8)                                               /*!< USPI_T::PROTSTS: SSINAIF Position      */
#define USPI_PROTSTS_SSINAIF_Msk         (0x1ul << USPI_PROTSTS_SSINAIF_Pos)               /*!< USPI_T::PROTSTS: SSINAIF Mask          */

#define USPI_PROTSTS_SSACTIF_Pos         (9)                                               /*!< USPI_T::PROTSTS: SSACTIF Position      */
#define USPI_PROTSTS_SSACTIF_Msk         (0x1ul << USPI_PROTSTS_SSACTIF_Pos)               /*!< USPI_T::PROTSTS: SSACTIF Mask          */

#define USPI_PROTSTS_SSLINE_Pos          (16)                                              /*!< USPI_T::PROTSTS: SSLINE Position       */
#define USPI_PROTSTS_SSLINE_Msk          (0x1ul << USPI_PROTSTS_SSLINE_Pos)                /*!< USPI_T::PROTSTS: SSLINE Mask           */

#define USPI_PROTSTS_BUSY_Pos            (17)                                              /*!< USPI_T::PROTSTS: BUSY Position         */
#define USPI_PROTSTS_BUSY_Msk            (0x1ul << USPI_PROTSTS_BUSY_Pos)                  /*!< USPI_T::PROTSTS: BUSY Mask             */

#define USPI_PROTSTS_SLVUDR_Pos          (18)                                              /*!< USPI_T::PROTSTS: SLVUDR Position       */
#define USPI_PROTSTS_SLVUDR_Msk          (0x1ul << USPI_PROTSTS_SLVUDR_Pos)                /*!< USPI_T::PROTSTS: SLVUDR Mask           */

#define USPI_IUR_TDIPTR_Pos              (0)                                               /*!< USPI_T::IUR: TDIPTR Position           */
#define USPI_IUR_TDIPTR_Msk              (0x1ful << USPI_IUR_TDIPTR_Pos)                   /*!< USPI_T::IUR: TDIPTR Mask               */

#define USPI_IUR_TDOPTR_Pos              (5)                                               /*!< USPI_T::IUR: TDOPTR Position           */
#define USPI_IUR_TDOPTR_Msk              (0x1ful << USPI_IUR_TDOPTR_Pos)                   /*!< USPI_T::IUR: TDOPTR Mask               */

#define USPI_IUR_RDIPTR_Pos              (10)                                              /*!< USPI_T::IUR: RDIPTR Position           */
#define USPI_IUR_RDIPTR_Msk              (0x1ful << USPI_IUR_RDIPTR_Pos)                   /*!< USPI_T::IUR: RDIPTR Mask               */

#define USPI_IUR_RDOPTR_Pos              (15)                                              /*!< USPI_T::IUR: RDOPTR Position           */
#define USPI_IUR_RDOPTR_Msk              (0x1ful << USPI_IUR_RDOPTR_Pos)                   /*!< USPI_T::IUR: RDOPTR Mask               */

#define USPI_IUR_SELFTEST_Pos            (30)                                              /*!< USPI_T::IUR: SELFTEST Position         */
#define USPI_IUR_SELFTEST_Msk            (0x1ul << USPI_IUR_SELFTEST_Pos)                  /*!< USPI_T::IUR: SELFTEST Mask             */

#define USPI_IUR_HDPRSEL_Pos             (31)                                              /*!< USPI_T::IUR: HDPRSEL Position          */
#define USPI_IUR_HDPRSEL_Msk             (0x1ul << USPI_IUR_HDPRSEL_Pos)                   /*!< USPI_T::IUR: HDPRSEL Mask              */

/**@}*/ /* USPI_CONST */
/**@}*/ /* end of USPI register group */
/**@}*/ /* end of REGISTER group */

#if defined ( __CC_ARM   )
#pragma no_anon_unions
#endif

#endif /* __USPI_REG_H__ */
